leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxPort_reg.h
/**
 * \file IfxPort_reg.h
 * \brief
 * \copyright Copyright (c) 2016 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC23X_UM_V1.1.R1
 * Specification: tc23x_um_sfrs_MCSFR.xml (Revision: UM_V1.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Port_Cfg Port address
 * \ingroup IfxLld_Port
 * 
 * \defgroup IfxLld_Port_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P00 2-P00
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P02 2-P02
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P10 2-P10
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P11 2-P11
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P13 2-P13
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P14 2-P14
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P15 2-P15
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P20 2-P20
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P21 2-P21
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P22 2-P22
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P23 2-P23
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P33 2-P33
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P34 2-P34
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P40 2-P40
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P41 2-P41
 * \ingroup IfxLld_Port_Cfg
 * 
 */
#ifndef IFXPORT_REG_H
#define IFXPORT_REG_H 1
/******************************************************************************/
#include "IfxPort_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_BaseAddress
 * \{  */

/** \brief  Port object */
#define MODULE_P00 /*lint --e(923)*/ (*(Ifx_P*)0xF003A000u)

/** \brief  Port object */
#define MODULE_P02 /*lint --e(923)*/ (*(Ifx_P*)0xF003A200u)

/** \brief  Port object */
#define MODULE_P10 /*lint --e(923)*/ (*(Ifx_P*)0xF003B000u)

/** \brief  Port object */
#define MODULE_P11 /*lint --e(923)*/ (*(Ifx_P*)0xF003B100u)

/** \brief  Port object */
#define MODULE_P13 /*lint --e(923)*/ (*(Ifx_P*)0xF003B300u)

/** \brief  Port object */
#define MODULE_P14 /*lint --e(923)*/ (*(Ifx_P*)0xF003B400u)

/** \brief  Port object */
#define MODULE_P15 /*lint --e(923)*/ (*(Ifx_P*)0xF003B500u)

/** \brief  Port object */
#define MODULE_P20 /*lint --e(923)*/ (*(Ifx_P*)0xF003C000u)

/** \brief  Port object */
#define MODULE_P21 /*lint --e(923)*/ (*(Ifx_P*)0xF003C100u)

/** \brief  Port object */
#define MODULE_P22 /*lint --e(923)*/ (*(Ifx_P*)0xF003C200u)

/** \brief  Port object */
#define MODULE_P23 /*lint --e(923)*/ (*(Ifx_P*)0xF003C300u)

/** \brief  Port object */
#define MODULE_P33 /*lint --e(923)*/ (*(Ifx_P*)0xF003D300u)

/** \brief  Port object */
#define MODULE_P34 /*lint --e(923)*/ (*(Ifx_P*)0xF003D400u)

/** \brief  Port object */
#define MODULE_P40 /*lint --e(923)*/ (*(Ifx_P*)0xF003E000u)

/** \brief  Port object */
#define MODULE_P41 /*lint --e(923)*/ (*(Ifx_P*)0xF003E100u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P00
 * \{  */

/** \brief  FC, Port Access Enable Register 0 */
#define P00_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003A0FCu)

/** \brief  F8, Port Access Enable Register 1 */
#define P00_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003A0F8u)

/** \brief  50, Port Emergency Stop Register */
#define P00_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003A050u)

/** \brief  8, Identification Register */
#define P00_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003A008u)

/** \brief  24, Port Input Register */
#define P00_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003A024u)

/** \brief  10, Port Input/Output Control Register 0 */
#define P00_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003A010u)

/** \brief  1C, Port Input/Output Control Register 12 */
#define P00_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003A01Cu)

/** \brief  14, Port Input/Output Control Register 4 */
#define P00_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003A014u)

/** \brief  18, Port Input/Output Control Register 8 */
#define P00_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003A018u)

/** \brief  94, Port Output Modification Clear Register */
#define P00_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003A094u)

/** \brief  80, Port Output Modification Clear Register 0 */
#define P00_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003A080u)

/** \brief  8C, Port Output Modification Clear Register 12 */
#define P00_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003A08Cu)

/** \brief  84, Port Output Modification Clear Register 4 */
#define P00_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003A084u)

/** \brief  88, Port Output Modification Clear Register 8 */
#define P00_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003A088u)

/** \brief  4, Port Output Modification Register */
#define P00_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003A004u)

/** \brief  90, Port Output Modification Set Register */
#define P00_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003A090u)

/** \brief  70, Port Output Modification Set Register 0 */
#define P00_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003A070u)

/** \brief  7C, Port Output Modification Set Register 12 */
#define P00_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003A07Cu)

/** \brief  74, Port Output Modification Set Register 4 */
#define P00_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003A074u)

/** \brief  78, Port Output Modification Set Register 8 */
#define P00_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003A078u)

/** \brief  0, Port Output Register */
#define P00_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003A000u)

/** \brief  40, Port Pad Driver Mode 0 Register */
#define P00_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003A040u)

/** \brief  44, Port Pad Driver Mode 1 Register */
#define P00_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003A044u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P02
 * \{  */

/** \brief  FC, Port Access Enable Register 0 */
#define P02_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003A2FCu)

