leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxPort_reg.h
/** \brief  F8, Port Access Enable Register 1 */
#define P33_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003D3F8u)

/** \brief  50, Port Emergency Stop Register */
#define P33_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003D350u)

/** \brief  8, Identification Register */
#define P33_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003D308u)

/** \brief  24, Port Input Register */
#define P33_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003D324u)

/** \brief  10, Port Input/Output Control Register 0 */
#define P33_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003D310u)

/** \brief  1C, Port Input/Output Control Register 12 */
#define P33_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003D31Cu)

/** \brief  14, Port Input/Output Control Register 4 */
#define P33_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003D314u)

/** \brief  18, Port Input/Output Control Register 8 */
#define P33_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003D318u)

/** \brief  94, Port Output Modification Clear Register */
#define P33_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003D394u)

/** \brief  80, Port Output Modification Clear Register 0 */
#define P33_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003D380u)

/** \brief  8C, Port Output Modification Clear Register 12 */
#define P33_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003D38Cu)

/** \brief  84, Port Output Modification Clear Register 4 */
#define P33_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003D384u)

/** \brief  88, Port Output Modification Clear Register 8 */
#define P33_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003D388u)

/** \brief  4, Port Output Modification Register */
#define P33_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003D304u)

/** \brief  90, Port Output Modification Set Register */
#define P33_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003D390u)

/** \brief  70, Port Output Modification Set Register 0 */
#define P33_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003D370u)

/** \brief  7C, Port Output Modification Set Register 12 */
#define P33_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003D37Cu)

/** \brief  74, Port Output Modification Set Register 4 */
#define P33_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003D374u)

/** \brief  78, Port Output Modification Set Register 8 */
#define P33_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003D378u)

/** \brief  0, Port Output Register */
#define P33_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003D300u)

/** \brief  40, Port Pad Driver Mode 0 Register */
#define P33_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003D340u)

/** \brief  44, Port Pad Driver Mode 1 Register */
#define P33_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003D344u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P34
 * \{  */

/** \brief  FC, Port Access Enable Register 0 */
#define P34_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003D4FCu)

/** \brief  F8, Port Access Enable Register 1 */
#define P34_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003D4F8u)

/** \brief  50, Port Emergency Stop Register */
#define P34_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003D450u)

/** \brief  8, Identification Register */
#define P34_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003D408u)

/** \brief  24, Port Input Register */
#define P34_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003D424u)

/** \brief  10, Port Input/Output Control Register 0 */
#define P34_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003D410u)

/** \brief  94, Port Output Modification Clear Register */
#define P34_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003D494u)

/** \brief  80, Port Output Modification Clear Register 0 */
#define P34_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003D480u)

/** \brief  4, Port Output Modification Register */
#define P34_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003D404u)

/** \brief  90, Port Output Modification Set Register */
#define P34_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003D490u)

/** \brief  70, Port Output Modification Set Register 0 */
#define P34_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003D470u)

/** \brief  0, Port Output Register */
#define P34_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003D400u)

/** \brief  40, Port Pad Driver Mode 0 Register */
#define P34_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003D440u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P40
 * \{  */

/** \brief  FC, Port Access Enable Register 0 */
#define P40_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003E0FCu)

/** \brief  F8, Port Access Enable Register 1 */
#define P40_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003E0F8u)

/** \brief  8, Identification Register */
#define P40_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003E008u)

/** \brief  24, Port Input Register */
#define P40_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003E024u)

/** \brief  10, Port Input/Output Control Register 0 */
#define P40_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003E010u)

/** \brief  14, Port Input/Output Control Register 4 */
#define P40_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003E014u)

/** \brief  18, Port Input/Output Control Register 8 */
#define P40_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003E018u)

/** \brief  64, Port Pin Controller Select Register */
#define P40_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003E064u)

/** \brief  60, Port Pin Function Decision Control Register */
#define P40_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003E060u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P41
 * \{  */

/** \brief  FC, Port Access Enable Register 0 */
#define P41_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003E1FCu)

/** \brief  F8, Port Access Enable Register 1 */
#define P41_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003E1F8u)

/** \brief  8, Identification Register */
#define P41_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003E108u)

/** \brief  24, Port Input Register */
#define P41_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003E124u)

/** \brief  10, Port Input/Output Control Register 0 */
#define P41_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003E110u)

/** \brief  14, Port Input/Output Control Register 4 */
#define P41_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003E114u)

/** \brief  18, Port Input/Output Control Register 8 */
#define P41_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003E118u)

/** \brief  64, Port Pin Controller Select Register */
#define P41_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003E164u)

/** \brief  60, Port Pin Function Decision Control Register */
#define P41_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003E160u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPORT_REG_H */
